Логические операторы.
Логические операторы в Perl деляться на четыре группы:
1. Операторы И, ИЛИ, НЕ:
  a. <выражениеA> && <выражениеB> - оператор И;
  b. <выражениеA> || <выражениеB> - оператор ИЛИ;
  c. !<выражениеA> - оператор НЕ.
2. Операторы для работы с числами:
  a. <числоA> == <числоB> - "числоA" равно "числуB";
  b. <числоA> != <числоB> - "числоA" не равно "числуB";
  c. <числоA> < <числоB> - "числоA" меньше "числаB";
  d. <числоA> <= <числоB> - "числоA" меньше или равно "числуB";
  e. <числоA> > <числоB> - "числоA" больше "числаB";
  f. <числоA> >= <числоB> - "числоA" больше или равно "числуB".
3. Операторы для работы со строками:
  a. <строкаA> eq <строкаB> - "строкаA" эквивалентна "строкеB";
  b. <строкаA> ne <строкаB> - "строкаA" не эквивалентна "строкеB";
  c. <строкаA> lt <строкаB> - "строкаA" больше "строкиB";
  d. <строкаA> le <строкаB> - "строкаA" больше или эквивалентна "строкеB";
  e. <строкаA> gt <строкаB> - "строкаA" меньше "строкиB";
  f. <строкаA> ge <строкаB> - "строкаA" меньше или эквивалентна "строкеB";
  g. <строкаA> =~ <regex> - "строкаA" соответствует "regex" ("regex" имеет вид m/шаблон/);
  h. <строкаA> !~ <regex> - "строкаA" не соответствует "regex" ("regex" имеет вид m/шаблон/).
4. Операторы для работы с файловой системой:
  a. -e файл - "файл" существует
  b. -d файл - "файл" является каталогом
  c. -f файл - "файл" является файлом
  d. -l файл - "файл" является ссылкой
  e. -T файл - "файл" является текстовым
  f. -z файл - "файл" имеет нулевую длину
  g. -s файл - "файл" имеет ненулевую длину
  h. -r файл - "файл" доступен для чтения пользователю (-R группе)
  i. -w файл - "файл" доступен для записи пользователю (-W группе)
  j. -x файл - "файл" доступен для выполнения пользователю (-X группе)
  k. -rwx файл - разрешено использование нескольких флагов проверки "файла" перечисленных после тире
